In [20]:
import pandas as pd

In [21]:
strArray = pd.array(['a','b','c'])
strArray

<StringArray>
['a', 'b', 'c']
Length: 3, dtype: string

In [22]:
mixedArray = pd.array([1,2,'a'],dtype="object")
mixedArray

<PandasArray>
[1, 2, 'a']
Length: 3, dtype: object

## Timestamp

In [23]:
ts1 = pd.Timestamp("23-01-16")
ts1

Timestamp('2016-01-23 00:00:00')

In [24]:
ts2 = pd.Timestamp("2023-1-16 16:00:00")

In [25]:
ts2

Timestamp('2023-01-16 16:00:00')

In [26]:
ts2.strftime("%d-%m-%Y %H:%M")

'16-01-2023 16:00'

In [27]:
ts1.replace(year=1999)

Timestamp('1999-01-23 00:00:00')

In [28]:
data = {
    "Name": ["John Doe", "Jane Smith", "Michael Johnson", "Emily Brown", "Daniel Lee", "Sarah Wilson", "David Thompson", "Olivia Davis", "William Martinez", "Sophia Anderson"],
    "Education": ["Bachelor's Degree", "Master's Degree", "High School Diploma", "PhD", "Associate's Degree", "Master's Degree", "Bachelor's Degree", "High School Diploma", "Associate's Degree", "Bachelor's Degree"]
}
df = pd.DataFrame(data)
df

               Name            Education
0          John Doe    Bachelor's Degree
1        Jane Smith      Master's Degree
2   Michael Johnson  High School Diploma
3       Emily Brown                  PhD
4        Daniel Lee   Associate's Degree
5      Sarah Wilson      Master's Degree
6    David Thompson    Bachelor's Degree
7      Olivia Davis  High School Diploma
8  William Martinez   Associate's Degree
9   Sophia Anderson    Bachelor's Degree

In [29]:
df.sort_values("Education")

               Name            Education
4        Daniel Lee   Associate's Degree
8  William Martinez   Associate's Degree
0          John Doe    Bachelor's Degree
6    David Thompson    Bachelor's Degree
9   Sophia Anderson    Bachelor's Degree
2   Michael Johnson  High School Diploma
7      Olivia Davis  High School Diploma
1        Jane Smith      Master's Degree
5      Sarah Wilson      Master's Degree
3       Emily Brown                  PhD

In [30]:
df['Education'] = pd.Categorical(df['Education'],categories=["PhD","Master's Degree","Bachelor's Degree","Associate's Degree","High School Diploma"],ordered=True)

In [31]:
df['Education']

0      Bachelor's Degree
1        Master's Degree
2    High School Diploma
3                    PhD
4     Associate's Degree
5        Master's Degree
6      Bachelor's Degree
7    High School Diploma
8     Associate's Degree
9      Bachelor's Degree
Name: Education, dtype: category
Categories (5, object): ['PhD' < 'Master's Degree' < 'Bachelor's Degree' < 'Associate's Degree' < 'High School Diploma']

In [32]:
df.sort_values('Education')

               Name            Education
3       Emily Brown                  PhD
1        Jane Smith      Master's Degree
5      Sarah Wilson      Master's Degree
0          John Doe    Bachelor's Degree
6    David Thompson    Bachelor's Degree
9   Sophia Anderson    Bachelor's Degree
4        Daniel Lee   Associate's Degree
8  William Martinez   Associate's Degree
2   Michael Johnson  High School Diploma
7      Olivia Davis  High School Diploma

In [34]:
df.loc[df.Education > "PhD"]

               Name            Education
0          John Doe    Bachelor's Degree
1        Jane Smith      Master's Degree
2   Michael Johnson  High School Diploma
4        Daniel Lee   Associate's Degree
5      Sarah Wilson      Master's Degree
6    David Thompson    Bachelor's Degree
7      Olivia Davis  High School Diploma
8  William Martinez   Associate's Degree
9   Sophia Anderson    Bachelor's Degree